        select appointment-file assign "$MFOCALDIR/appoint.dat"
         organization is indexed
         access is dynamic
         record key is appointment-key
         status is ws-file-status.
