       
       03 :Prefix-:dataflow-demo.
         05 :Prefix-:text            pic x(50) value spaces.
         05 :Prefix-:num             pic 9(5) value 0.
