       01 :Prefix-:date-yyyymmdd.
         03 yyyy      pic xxxx.
         03 mm        pic xx.
         03 dd        pic xx.
 
       01 :Prefix-:date-info.
         03 :Prefix-:day-of-week-name   pic xxx.
         03 :Prefix-:day-of-week-num    pic 9.
         03 :Prefix-:week-num           pic 99.