       $if service-flags not defined
       01 service-flags        pic x external.
*>       88 flag-rest-mode           value "r", "R".
*>      88 flag-adis-mode           value "a", "A".
       88 service-flags-valid  value "a", "A", "r", "R".
       $end
