       program-id. "setadismode".
       working-storage section.
       copy "common_ex.cpy".
       local-storage section.
       procedure division.
           move "A" to service-flags
           goback.
       end program.
